extension/src/InformationRegisters/мкпТокеныПодтверждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпТокеныПодтверждения</Name>
			<Comment>confirm_token dry-run: отпечаток тела и срок.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>64</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ВидОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>50</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>36</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проводить</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Истекает</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоJSON</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/InformationRegisters/мкпОперацииСессии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпОперацииСессии</Name>
			<Comment>Журнал записи сессии агента для группового отката.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСессии</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>64</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>10</v8:Digits>
						<v8:FractionDigits>0</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Операция</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>20</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>50</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>36</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнимокJSON</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/InformationRegisters/мкпКлючиИдемпотентности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпКлючиИдемпотентности</Name>
			<Comment>Повтор с тем же Idempotency-Key не создаёт дубль.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.мкпКлиентыИнтеграции</v8:Type>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>128</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатJSON</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Момент</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/CommonModules/мкпДанные/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция Список(Вид, Имя, ПараметрыЗапроса) Экспорт

	Мета = НайтиМетаданные(Вид, Имя);
	Если Мета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Лимит = 50;
	Курсор = "";
	ФильтрТекст = "";
	ПоляТекст = "";
	Если ПараметрыЗапроса <> Неопределено Тогда
		Если ПараметрыЗапроса.Получить("limit") <> Неопределено Тогда
			Лимит = Число(ПараметрыЗапроса.Получить("limit"));
		КонецЕсли;
		Если ПараметрыЗапроса.Получить("cursor") <> Неопределено Тогда
			Курсор = Строка(ПараметрыЗапроса.Получить("cursor"));
		КонецЕсли;
		Если ПараметрыЗапроса.Получить("filter") <> Неопределено Тогда
			ФильтрТекст = Строка(ПараметрыЗапроса.Получить("filter"));
		КонецЕсли;
		Если ПараметрыЗапроса.Получить("fields") <> Неопределено Тогда
			ПоляТекст = Строка(ПараметрыЗапроса.Получить("fields"));
		КонецЕсли;
	КонецЕсли;
	Если Лимит < 1 Тогда
		Лимит = 1;
	КонецЕсли;
	Если Лимит > 500 Тогда
		Лимит = 500;
	КонецЕсли;

	Фильтры = Неопределено;
	Если Не ПустаяСтрока(ФильтрТекст) Тогда
		Фильтры = мкпСериализация.ИзJSON(ФильтрТекст);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = СобратьТекстЗапроса(Вид, Мета.Имя, Фильтры, Курсор, Лимит + 1, Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Элементы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если Элементы.Количество() >= Лимит Тогда
			Прервать;
		КонецЕсли;
		Элементы.Добавить(СериализоватьСтроку(Выборка, РезультатЗапроса, Вид, Мета.Имя, ПоляТекст));
	КонецЦикла;

	ЕстьЕщё = Выборка.Количество() > Лимит;
	СледующийКурсор = Неопределено;
	Если ЕстьЕщё И Элементы.Количество() > 0 Тогда
		СледующийКурсор = Строка(Элементы[Элементы.ВГраница()]["id"]);
	КонецЕсли;

	Возврат Новый Структура("content_kind,kind,name,items,next_cursor,has_more",
		"data", Вид, Мета.Имя, Элементы, СледующийКурсор, ЕстьЕщё);

КонецФункции

Функция ПолучитьПоИд(Вид, Имя, Ид) Экспорт

	Мета = НайтиМетаданные(Вид, Имя);
	Если Мета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Вид <> "catalog" И Вид <> "document" Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ссылка = СсылкаПоИд(Вид, Мета.Имя, Ид);
	Если Ссылка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.*
		|ИЗ
		|	" + ИмяТаблицы(Вид, Мета.Имя) + " КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Элемент = СериализоватьСтроку(Выборка, РезультатЗапроса, Вид, Мета.Имя, "");
	Возврат Новый Структура("content_kind,kind,name,item", "data", Вид, Мета.Имя, Элемент);

КонецФункции

Функция Предпросмотр(Вид, Имя, ТелоJSON, Клиент) Экспорт

	Данные = ПрочитатьТелоЗаписи(ТелоJSON);
	Если Данные = Неопределено Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Некорректный JSON");
	КонецЕсли;
	Элемент = ПолеЗаписи(Данные, "item");
	Если ТипЗнч(Элемент) <> Тип("Соответствие") И ТипЗнч(Элемент) <> Тип("Структура") Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Нужно поле item");
	КонецЕсли;
	Мета = НайтиМетаданные(Вид, Имя);
	Если Мета = Неопределено Тогда
		Возврат ОшибкаЗаписи(404, "not_found", "Нет выборки " + Вид + "/" + Имя);
	КонецЕсли;
	Проводить = ПолеЗаписи(Данные, "post") = Истина;
	Проверки = ПроверитьЗаполнениеПолей(Вид, Мета, Элемент);
	Для Каждого Сообщение Из мкпБезопасность.ПроверитьЛимитыКлиента(Клиент, Элемент) Цикл
		Проверки.Добавить(Сообщение);
	КонецЦикла;
	Если Проводить Тогда
		Для Каждого Сообщение Из ПроверитьПроведение(Вид, Элемент) Цикл
			Проверки.Добавить(Сообщение);
		КонецЦикла;
	КонецЕсли;
	Токен = "dry-" + Строка(Новый УникальныйИдентификатор);
	Запись = РегистрыСведений.мкпТокеныПодтверждения.СоздатьМенеджерЗаписи();
	Запись.Токен = Токен;
	Запись.ВидОбъекта = Вид;
	Запись.ИмяОбъекта = Мета.Имя;
	Запись.ИдОбъекта = Строка(ПолеЗаписи(Элемент, "id"));
	Запись.Отпечаток = ОтпечатокЭлемента(Элемент);
	Запись.Проводить = Проводить;
	Запись.Истекает = ТекущаяУниверсальнаяДата() + 600;
	Запись.ТелоJSON = мкпСериализация.ВJSON(Элемент);
	Запись.Записать();
	Тело = Новый Структура;
	Тело.Вставить("confirm_token", Токен);
	Тело.Вставить("expires_at", Формат(Запись.Истекает, "ДФ=yyyy-MM-ddTHH:mm:ss") + "Z");
	Тело.Вставить("preview", Элемент);
	Тело.Вставить("fill_check", Проверки);
	Эффекты = Новый Массив;
	Если Проводить Тогда
		Эффекты.Добавить("Будет установлен признак проведения");
	КонецЕсли;
	Тело.Вставить("posting_effects", Эффекты);
	Возврат УспехЗаписи(200, Тело);

КонецФункции

Функция Создать(Вид, Имя, ТелоJSON, Запрос, Клиент) Экспорт

	Возврат ЗаписатьОбъект(Вид, Имя, "", ТелоJSON, Запрос, Клиент, "create");

КонецФункции

Функция Изменить(Вид, Имя, Ид, ТелоJSON, Запрос, Клиент) Экспорт

	Возврат ЗаписатьОбъект(Вид, Имя, Ид, ТелоJSON, Запрос, Клиент, "patch");

КонецФункции

Функция Провести(Вид, Имя, Ид, ТелоJSON, Запрос, Клиент) Экспорт

	Ключ = ЗаголовокЗапроса(Запрос, "Idempotency-Key");
	Если СтрДлина(Ключ) < 8 Или СтрДлина(Ключ) > 128 Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Нужен заголовок Idempotency-Key (8–128 символов)");
	КонецЕсли;
	Мета = НайтиМетаданные(Вид, Имя);
	Если Мета = Неопределено Или Вид <> "document" Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Проводить можно только документы");
	КонецЕсли;
	Повтор = НайтиИдемпотентность(Клиент, Ключ, "post:" + Ид);
	Если Повтор <> Неопределено Тогда
		Если Повтор.Свойство("КодОшибки") Тогда
			Возврат Повтор;
		КонецЕсли;
		Возврат УспехЗаписи(200, Повтор.Тело);
	КонецЕсли;
	Данные = ПрочитатьТелоЗаписи(ТелоJSON);
	Если Данные = Неопределено Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Некорректный JSON");
	КонецЕсли;
	Токен = ПолеЗаписи(Данные, "confirm_token");
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "Сначала dry-run с post=true, затем проведение с confirm_token");
	КонецЕсли;
	ПроверкаТокена = ПроверитьТокен(Токен, Вид, Мета.Имя, Ид, Неопределено);
	Если ПроверкаТокена <> Неопределено Тогда
		Возврат ПроверкаТокена;
	КонецЕсли;
	Ссылка = СсылкаПоИд(Вид, Мета.Имя, Ид);
	Если Ссылка = Неопределено Тогда
		Возврат ОшибкаЗаписи(404, "not_found", "Объект не найден");
	КонецЕсли;
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	Если ДокументОбъект = Неопределено Тогда
		Возврат ОшибкаЗаписи(404, "not_found", "Объект не найден");
	КонецЕсли;
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ОшибкаЗаписи(422, "posting_failed", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Результат = РезультатЗаписи(ДокументОбъект.Ссылка, Истина);
	ЗапомнитьИдемпотентность(Клиент, Ключ, "post:" + Ид, Результат);
	ЗапомнитьОперациюСессии(Запрос, "post", Вид, Мета.Имя, Ид, "");
	Возврат УспехЗаписи(200, Результат);

КонецФункции

Функция ОткатитьСессию(ТелоJSON, Запрос, Клиент) Экспорт

	Данные = ПрочитатьТелоЗаписи(ТелоJSON);
	Если Данные = Неопределено Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Некорректный JSON");
	КонецЕсли;
	Сессия = ПолеЗаписи(Данные, "session_id");
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Нужен session_id");
	КонецЕсли;
	ЗапросРС = Новый Запрос;
	ЗапросРС.Текст =
	"ВЫБРАТЬ
	|	Операции.Номер КАК Номер,
	|	Операции.Операция КАК Операция,
	|	Операции.ВидОбъекта КАК ВидОбъекта,
	|	Операции.ИмяОбъекта КАК ИмяОбъекта,
	|	Операции.ИдОбъекта КАК ИдОбъекта,
	|	Операции.СнимокJSON КАК СнимокJSON
	|ИЗ
	|	РегистрСведений.мкпОперацииСессии КАК Операции
	|ГДЕ
	|	Операции.ИдентификаторСессии = &Сессия
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	ЗапросРС.УстановитьПараметр("Сессия", Строка(Сессия));
	Выборка = ЗапросРС.Выполнить().Выбрать();
	Отменённые = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Ссылка = СсылкаПоИд(Выборка.ВидОбъекта, Выборка.ИмяОбъекта, Выборка.ИдОбъекта);
		Если Ссылка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Объект = Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.Операция = "create" Тогда
			Объект.УстановитьПометкуУдаления(Истина);
		ИначеЕсли Выборка.Операция = "post" И Выборка.ВидОбъекта = "document" Тогда
			Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		Отменённые.Добавить(мкпСериализация.СсылкаВJSON(Ссылка));
	КонецЦикла;
	Набор = РегистрыСведений.мкпОперацииСессии.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСессии.Установить(Строка(Сессия));
	Набор.Записать();
	Возврат УспехЗаписи(200, Новый Структура("session_id,undone", Строка(Сессия), Отменённые));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиМетаданные(Вид, Имя)

	Если Не мкпСериализация.ИмяМетаданныхБезопасно(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если мкпБезопасность.ЭтоСлужебныйОбъект(Имя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Вид = "catalog" Тогда
		Возврат Метаданные.Справочники.Найти(Имя);
	ИначеЕсли Вид = "document" Тогда
		Возврат Метаданные.Документы.Найти(Имя);
	ИначеЕсли Вид = "information_register" Тогда
		Возврат Метаданные.РегистрыСведений.Найти(Имя);
	ИначеЕсли Вид = "accumulation_register" Тогда
		Возврат Метаданные.РегистрыНакопления.Найти(Имя);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ИмяТаблицы(Вид, Имя)

	Если Вид = "catalog" Тогда
		Возврат "Справочник." + Имя;
	ИначеЕсли Вид = "document" Тогда
		Возврат "Документ." + Имя;
	ИначеЕсли Вид = "accumulation_register" Тогда
		Возврат "РегистрНакопления." + Имя;
	КонецЕсли;
	Возврат "РегистрСведений." + Имя;

КонецФункции

Функция СсылкаПоИд(Вид, Имя, Ид)

	Попытка
		Уид = Новый УникальныйИдентификатор(Ид);
		Если Вид = "catalog" Тогда
			Возврат Справочники[Имя].ПолучитьСсылку(Уид);
		КонецЕсли;
		Возврат Документы[Имя].ПолучитьСсылку(Уид);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция СобратьТекстЗапроса(Вид, Имя, Фильтры, Курсор, ЛимитВыборки, Запрос)

	ЛимитСтрока = Формат(ЛимитВыборки, "ЧГ=0");
	ЕстьСсылка = (Вид = "catalog" Или Вид = "document");
	Текст =
		"ВЫБРАТЬ ПЕРВЫЕ " + ЛимитСтрока + "
		|	Т.*
		|ИЗ
		|	" + ИмяТаблицы(Вид, Имя) + " КАК Т
		|ГДЕ
		|	ИСТИНА";

	Если ЕстьСсылка И Курсор <> "" Тогда
		Текст = Текст + "
		|	И Т.Ссылка > &Курсор";
		СсылкаКурсора = СсылкаПоИд(Вид, Имя, Курсор);
		Если СсылкаКурсора <> Неопределено Тогда
			Запрос.УстановитьПараметр("Курсор", СсылкаКурсора);
		КонецЕсли;
	КонецЕсли;

	ДобавитьУсловияФильтра(Текст, Фильтры, Запрос);

	Если ЕстьСсылка Тогда
		Текст = Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	Т.Ссылка";
	КонецЕсли;
	Возврат Текст;

КонецФункции

Процедура ДобавитьУсловияФильтра(Текст, Фильтры, Запрос)

	Если Фильтры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Номер = 0;
	Для Каждого КлючИЗначение Из Фильтры Цикл
		Поле = Строка(КлючИЗначение.Ключ);
		Если Не мкпСериализация.ИмяМетаданныхБезопасно(Поле) Тогда
			Продолжить;
		КонецЕсли;
		Номер = Номер + 1;
		ИмяПараметра = "П" + Формат(Номер, "ЧГ=0");
		Значение = КлючИЗначение.Значение;
		Если ТипЗнч(Значение) = Тип("Соответствие") Или ТипЗнч(Значение) = Тип("Структура") Тогда
			ДобавитьСоставнойФильтр(Текст, Поле, Значение, ИмяПараметра, Запрос);
		Иначе
			Текст = Текст + "
			|	И Т." + Поле + " = &" + ИмяПараметра;
			Запрос.УстановитьПараметр(ИмяПараметра, Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьСоставнойФильтр(Текст, Поле, Значение, ИмяПараметра, Запрос)

	ЗначениеGte = ЗначениеФильтра(Значение, "gte");
	Если ЗначениеGte <> Неопределено Тогда
		Текст = Текст + "
		|	И Т." + Поле + " >= &" + ИмяПараметра + "gte";
		Запрос.УстановитьПараметр(ИмяПараметра + "gte", ЗначениеGte);
	КонецЕсли;
	ЗначениеLte = ЗначениеФильтра(Значение, "lte");
	Если ЗначениеLte <> Неопределено Тогда
		Текст = Текст + "
		|	И Т." + Поле + " <= &" + ИмяПараметра + "lte";
		Запрос.УстановитьПараметр(ИмяПараметра + "lte", ЗначениеLte);
	КонецЕсли;
	ЗначениеEq = ЗначениеФильтра(Значение, "eq");
	Если ЗначениеEq = Неопределено Тогда
		ЗначениеEq = ЗначениеФильтра(Значение, "id");
	КонецЕсли;
	Если ЗначениеEq <> Неопределено Тогда
		Текст = Текст + "
		|	И Т." + Поле + " = &" + ИмяПараметра + "eq";
		Запрос.УстановитьПараметр(ИмяПараметра + "eq", ЗначениеEq);
	КонецЕсли;
	ЗначениеContains = ЗначениеФильтра(Значение, "contains");
	Если ЗначениеContains <> Неопределено Тогда
		Текст = Текст + "
		|	И Т." + Поле + " ПОДОБНО &" + ИмяПараметра + "contains";
		Запрос.УстановитьПараметр(ИмяПараметра + "contains", "%" + Строка(ЗначениеContains) + "%");
	КонецЕсли;

КонецПроцедуры

Функция ЗначениеФильтра(Значение, Ключ)

	Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
		Возврат Значение.Получить(Ключ);
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство(Ключ) Тогда
		Возврат Значение[Ключ];
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция СериализоватьСтроку(Выборка, РезультатЗапроса, Вид, Имя, ПоляТекст)

	Разрешенные = Неопределено;
	Если Не ПустаяСтрока(ПоляТекст) Тогда
		Разрешенные = Новый Соответствие;
		Для Каждого Часть Из СтрРазделить(ПоляТекст, ",", Ложь) Цикл
			Разрешенные.Вставить(СокрЛП(Часть), Истина);
		КонецЦикла;
	КонецЕсли;

	Элемент = Новый Структура;
	Ссылка = Неопределено;
	Попытка
		Ссылка = Выборка.Ссылка;
	Исключение
	КонецПопытки;

	Если Ссылка <> Неопределено Тогда
		Элемент.Вставить("id", Строка(Ссылка.УникальныйИдентификатор()));
		Элемент.Вставить("ref", мкпСериализация.СсылкаВJSON(Ссылка));
	КонецЕсли;

	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если ИмяКолонки = "Ссылка" Тогда
			Продолжить;
		КонецЕсли;
		Если Разрешенные <> Неопределено И Разрешенные.Получить(ИмяКолонки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Вставить(ИмяКолонки, мкпСериализация.ЗначениеВJSON(Выборка[ИмяКолонки]));
	КонецЦикла;

	Возврат Элемент;

КонецФункции

Функция ЗаписатьОбъект(Вид, Имя, Ид, ТелоJSON, Запрос, Клиент, Операция)

	Ключ = ЗаголовокЗапроса(Запрос, "Idempotency-Key");
	Если СтрДлина(Ключ) < 8 Или СтрДлина(Ключ) > 128 Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Нужен заголовок Idempotency-Key (8–128 символов)");
	КонецЕсли;
	Данные = ПрочитатьТелоЗаписи(ТелоJSON);
	Если Данные = Неопределено Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Некорректный JSON");
	КонецЕсли;
	Элемент = ПолеЗаписи(Данные, "item");
	Если ТипЗнч(Элемент) <> Тип("Соответствие") И ТипЗнч(Элемент) <> Тип("Структура") Тогда
		Возврат ОшибкаЗаписи(400, "bad_request", "Нужно поле item");
	КонецЕсли;
	Отпечаток = ОтпечатокЭлемента(Элемент);
	Повтор = НайтиИдемпотентность(Клиент, Ключ, Отпечаток);
	Если Повтор <> Неопределено Тогда
		Если Повтор.Свойство("КодОшибки") Тогда
			Возврат Повтор;
		КонецЕсли;
		Код = 201;
		Если Операция = "patch" Тогда
			Код = 200;
		КонецЕсли;
		Возврат УспехЗаписи(Код, Повтор.Тело);
	КонецЕсли;
	Токен = ПолеЗаписи(Данные, "confirm_token");
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "Сначала dry-run, затем запись с confirm_token");
	КонецЕсли;
	Мета = НайтиМетаданные(Вид, Имя);
	Если Мета = Неопределено Тогда
		Возврат ОшибкаЗаписи(404, "not_found", "Нет выборки " + Вид + "/" + Имя);
	КонецЕсли;
	ПроверкаТокена = ПроверитьТокен(Токен, Вид, Мета.Имя, Ид, Отпечаток);
	Если ПроверкаТокена <> Неопределено Тогда
		Возврат ПроверкаТокена;
	КонецЕсли;
	Проверки = ПроверитьЗаполнениеПолей(Вид, Мета, Элемент);
	Если Проверки.Количество() > 0 Тогда
		Возврат ОшибкаЗаписи(422, "fill_check_failed", СтрСоединить(Проверки, "; "));
	КонецЕсли;
	Лимиты = мкпБезопасность.ПроверитьЛимитыКлиента(Клиент, Элемент);
	Если Лимиты.Количество() > 0 Тогда
		Возврат ОшибкаЗаписи(400, "limit_exceeded", СтрСоединить(Лимиты, "; "));
	КонецЕсли;
	Если Операция = "create" Тогда
		Если Вид = "catalog" Тогда
			Объект = Справочники[Мета.Имя].СоздатьЭлемент();
		ИначеЕсли Вид = "document" Тогда
			Объект = Документы[Мета.Имя].СоздатьДокумент();
		Иначе
			Возврат ОшибкаЗаписи(400, "bad_request", "Запись поддерживается для catalog и document");
		КонецЕсли;
	Иначе
		Ссылка = СсылкаПоИд(Вид, Мета.Имя, Ид);
		Если Ссылка = Неопределено Тогда
			Возврат ОшибкаЗаписи(404, "not_found", "Объект не найден");
		КонецЕсли;
		Объект = Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Возврат ОшибкаЗаписи(404, "not_found", "Объект не найден");
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьРеквизиты(Объект, Элемент);
	Попытка
		Если ПолеЗаписи(Данные, "post") = Истина И Вид = "document" Тогда
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Объект.Записать();
		КонецЕсли;
	Исключение
		Возврат ОшибкаЗаписи(422, "fill_check_failed", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Проведён = Ложь;
	Попытка
		Проведён = Объект.Проведен;
	Исключение
		Проведён = Ложь;
	КонецПопытки;
	Результат = РезультатЗаписи(Объект.Ссылка, Проведён);
	ЗапомнитьИдемпотентность(Клиент, Ключ, Отпечаток, Результат);
	ЗапомнитьОперациюСессии(Запрос, Операция, Вид, Мета.Имя, Строка(Объект.Ссылка.УникальныйИдентификатор()), "");
	КодОтвета = 201;
	Если Операция = "patch" Тогда
		КодОтвета = 200;
	КонецЕсли;
	Возврат УспехЗаписи(КодОтвета, Результат);

КонецФункции

Функция ПрочитатьТелоЗаписи(ТелоJSON)

	Если ПустаяСтрока(СокрЛП(Строка(ТелоJSON))) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	Попытка
		Возврат мкпСериализация.ИзJSON(ТелоJSON);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция ПолеЗаписи(Данные, Имя)

	Если ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Возврат Данные.Получить(Имя);
	КонецЕсли;
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство(Имя) Тогда
		Возврат Данные[Имя];
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ЗаголовокЗапроса(Запрос, Имя)

	Значение = Запрос.Заголовки.Получить(Имя);
	Если Значение = Неопределено Тогда
		Значение = Запрос.Заголовки.Получить(НРег(Имя));
	КонецЕсли;
	Возврат СокрЛП(Строка(Значение));

КонецФункции

Функция ОтпечатокЭлемента(Элемент)

	Возврат мкпСериализация.ВJSON(Элемент);

КонецФункции

Функция ПроверитьТокен(Токен, Вид, Имя, Ид, Отпечаток)

	Запись = РегистрыСведений.мкпТокеныПодтверждения.СоздатьМенеджерЗаписи();
	Запись.Токен = Строка(Токен);
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "Нет действительного confirm_token. Сначала вызовите dry-run.");
	КонецЕсли;
	Если Запись.Истекает < ТекущаяУниверсальнаяДата() Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "Срок confirm_token истёк. Повторите dry-run.");
	КонецЕсли;
	Если Запись.ВидОбъекта <> Вид Или Запись.ИмяОбъекта <> Имя Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "confirm_token выдан для другого объекта метаданных");
	КонецЕсли;
	Если ЗначениеЗаполнено(Ид) И ЗначениеЗаполнено(Запись.ИдОбъекта) И Запись.ИдОбъекта <> Ид Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "confirm_token относится к другому объекту");
	КонецЕсли;
	Если Отпечаток <> Неопределено И Запись.Отпечаток <> Отпечаток Тогда
		Возврат ОшибкаЗаписи(400, "confirm_required", "Данные не совпадают с dry-run. Повторите предпросмотр.");
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция НайтиИдемпотентность(Клиент, Ключ, Отпечаток)

	Запись = РегистрыСведений.мкпКлючиИдемпотентности.СоздатьМенеджерЗаписи();
	Запись.Клиент = Клиент;
	Запись.Ключ = Ключ;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Запись.Отпечаток <> Отпечаток Тогда
		Возврат ОшибкаЗаписи(409, "idempotency_conflict", "Idempotency-Key уже использован с другим телом");
	КонецЕсли;
	Тело = мкпСериализация.ИзJSON(Запись.РезультатJSON);
	Возврат УспехЗаписи(200, Тело);

КонецФункции

Процедура ЗапомнитьИдемпотентность(Клиент, Ключ, Отпечаток, Результат)

	Запись = РегистрыСведений.мкпКлючиИдемпотентности.СоздатьМенеджерЗаписи();
	Запись.Клиент = Клиент;
	Запись.Ключ = Ключ;
	Запись.Отпечаток = Отпечаток;
	Запись.РезультатJSON = мкпСериализация.ВJSON(Результат);
	Запись.Момент = ТекущаяУниверсальнаяДата();
	Запись.Записать();

КонецПроцедуры

Процедура ЗапомнитьОперациюСессии(Запрос, Операция, Вид, Имя, Ид, Снимок)

	Сессия = ЗаголовокЗапроса(Запрос, "X-Session-Id");
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат;
	КонецЕсли;
	ЗапросНомера = Новый Запрос;
	ЗапросНомера.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Операции.Номер), 0) КАК Номер
	|ИЗ
	|	РегистрСведений.мкпОперацииСессии КАК Операции
	|ГДЕ
	|	Операции.ИдентификаторСессии = &Сессия";
	ЗапросНомера.УстановитьПараметр("Сессия", Сессия);
	Выборка = ЗапросНомера.Выполнить().Выбрать();
	Номер = 0;
	Если Выборка.Следующий() Тогда
		Номер = Выборка.Номер;
	КонецЕсли;
	Запись = РегистрыСведений.мкпОперацииСессии.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСессии = Сессия;
	Запись.Номер = Номер + 1;
	Запись.Операция = Операция;
	Запись.ВидОбъекта = Вид;
	Запись.ИмяОбъекта = Имя;
	Запись.ИдОбъекта = Ид;
	Запись.СнимокJSON = Снимок;
	Запись.Записать();

КонецПроцедуры

Функция ПроверитьЗаполнениеПолей(Вид, Мета, Элемент)

	Сообщения = Новый Массив;
	Для Каждого Реквизит Из Мета.Реквизиты Цикл
		Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			Значение = ПолеЗаписи(Элемент, Реквизит.Имя);
			Если Не ЗначениеЗаполнено(Значение) Тогда
				Сообщения.Добавить("Не заполнено поле " + Реквизит.Имя + " (" + Реквизит.Синоним + ")");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Вид = "catalog" Тогда
		Наименование = ПолеЗаписи(Элемент, "Description");
		Если Наименование = Неопределено Тогда
			Наименование = ПолеЗаписи(Элемент, "Наименование");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			Сообщения.Добавить("Не заполнено поле Description (Наименование)");
		КонецЕсли;
	КонецЕсли;
	Возврат Сообщения;

КонецФункции

Функция ПроверитьПроведение(Вид, Элемент)

	Сообщения = Новый Массив;
	Если Вид <> "document" Тогда
		Возврат Сообщения;
	КонецЕсли;
	Сумма = ПолеЗаписи(Элемент, "Amount");
	Если Сумма = Неопределено Тогда
		Сумма = ПолеЗаписи(Элемент, "СуммаДокумента");
	КонецЕсли;
	Если Сумма <> Неопределено Тогда
		Попытка
			Если Число(Сумма) <= 0 Тогда
				Сообщения.Добавить("Нельзя провести документ: сумма должна быть больше 0");
			КонецЕсли;
		Исключение
			Сообщения.Добавить("Поле суммы должно быть числом");
		КонецПопытки;
	КонецЕсли;
	Возврат Сообщения;

КонецФункции

Процедура ЗаполнитьРеквизиты(Объект, Элемент)

	Если ТипЗнч(Элемент) = Тип("Соответствие") Тогда
		Для Каждого КлючЗначение Из Элемент Цикл
			ИмяПоля = Строка(КлючЗначение.Ключ);
			Если ИмяПоля = "id" Или ИмяПоля = "ref" Тогда
				Продолжить;
			КонецЕсли;
			Попытка
				Объект[ИмяПоля] = КлючЗначение.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	Для Каждого КлючЗначение Из Элемент Цикл
		ИмяПоля = КлючЗначение.Ключ;
		Если ИмяПоля = "id" Или ИмяПоля = "ref" Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Объект[ИмяПоля] = КлючЗначение.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Функция РезультатЗаписи(Ссылка, Проведён)

	Возврат Новый Структура("ref,posted,warnings", мкпСериализация.СсылкаВJSON(Ссылка), Проведён, Новый Массив);

КонецФункции

Функция УспехЗаписи(КодСостояния, Тело)

	Возврат Новый Структура("КодСостояния,Тело", КодСостояния, Тело);

КонецФункции

Функция ОшибкаЗаписи(КодСостояния, КодОшибки, Подробность)

	Возврат Новый Структура("КодСостояния,КодОшибки,Подробность", КодСостояния, КодОшибки, Подробность);

КонецФункции

#КонецОбласти
